Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/the_irish_education_system/special_education.html.txt.tmx
Source language: en
Languages: ga

source: • The Appeals Board will have the power to direct the council to arrange the preparation of an assessment or of an education plan
ga: Tá sé de chumhacht ag an mBord Achomhairc ordú a thabhairt don chomhairle socruithe a dhéanamh chun an leanbh a mheas nó plean oideachais a cheapadh

source: In this case, the council must comply with the direction of the Appeals Board
ga: Ní mór don chomhairle géilleadh do threoir an Bhoird sa chás sin

source: • The Appeals Board may dismiss the appeal of the parents or principal
ga: Féadfaidh an Bord diúltú d’achomharc na dtuismitheoirí nó an phríomhoide

source: The 2004 Act also provides for a process of mediation following the exhaustion of any rights of appeal under the legislation
ga: Tá foráil in Acht na bliana 2004 go mbeadh próiseas idirghabhála ann má ídítear aon cheart achomhairc atá ann faoin reachtaíocht

source: The Education Act 1998
ga: An tAcht Oideachais 1998

source: The Education Act 1998 deals with education generally but emphasises the rights of children with disabilities and with other special educational needs
ga: Cuireann an tAcht Oideachais 1998 béim ar na cearta atá ag páistí le míchumas agus le riachtanais speisialta oideachais

source: This Act is in effect and provides that every person concerned with the implementation of the legislation must have regard to a number of objectives including:
ga: Leagann sé síos go gcaithfidh gach duine atá ag plé le cur i bhfeidhm na rachtaíochta, aird a thabhairt ar roinnt cuspóirí, ina measc:

source: • To give practical effect to the constitutional rights of children including children who have a disability or who have other special educational needs, as they relate to education
ga: • Go gcuirfí i bhfeidhm go praicticiúil ó thaobh an oideachais na cearta bunreachtúla atá ag páistí, ag cur san áireamh páistí a bhfuil míchumas orthu nó a bhfuil riachtanais speisialta oideachais acu

source: • To provide that, as far as is practicable and having regard to the resources available, a level and quality of education appropriate to the needs and abilities of the people of the country
ga: • Go gcuirfí ar fáil, chomh fada agus is féidir go praicticiúil agus ag cuimhniú ar na hachmhainní atá ann, oideachas den chaighdeán agus den chineál atá in oiriúint do riachtanais agus do chumas mhuintir na tíre

source: The Minister for Education and Skills is obliged, among other things, to ensure that everyone living in Ireland (including people with disabilities and people who have other special educational needs) has available support services and a level and quality of education appropriate to his/her needs and abilities
ga: Tá dualgas ar an Aire Oideachais agus Scileanna, i measc rudaí eile, a chinntiú go bhfuil fáil ag gach duine atá ag cónaí sa stát, daoine le míchumais agus le riachtanais speisialta eile oideachais san áireamh, ar sheirbhísí tacaíochta agus ar oideachas atá ar an gcaighdeán agus ar an gcineál atá oiriúnach dá riachtanais agus dá (h)éirim

source: The 1998 Act gives the Minister for Education and Skills certain functions in respect of funding, including the funding of support services for students with disabilities
ga: Cuireann an tAcht dualgais áirithe ar an Aire Oideachais agus Scileanna i leith airgeadú, ina measc airgeadú na seirbhísí tacaíochta do scoláirí le míchumais, ina measc

source: Schools must use their available resources to ensure that the educational needs of all students, including those with disabilities, are identified and provided for
ga: Cuireann sé de dhualgas ar scoileanna freisin a gcuid achmhainní a úsáid d'fhonn a chinntiú go n-aithnítear agus go ndéantar soláthar do na riachtanais oideachais atá ag na daltaí go léir iad siúd le mí chumais ina measc

source: Boards of Management are required to use the State resources provided to the school to make reasonable provisions and accommodation for students with disabilities or other special education needs, including, where necessary, alteration of buildings and the provision of appropriate equipment
ga: Cuireann sé de dhualgas ar an mBord Bainistíochta úsáid a bhaint as airgead a tháinig ón Stát, chun soláthar agus socrú reasúnta a dhéanamh do scoláirí le míchumas nó le riachtanais oideachais speisialta eile. I measc na socraithe seo bheadh, nuair ba ghá, athruithe le déanamh ar fhoirgnimh agus treallamh oiriúnach a chur ar fáil

source: The Act also provides that the criteria for funding of schools may allow for the payment of additional grants to schools, having regard to the level of educational disadvantage
ga: De réir an Achta freisin, d'fhéadfadh na slait tomhais le haghaidh airgeadú scoileanna, deontaisí breise a cheadú do scoileanna ag braith ar cén leibhéal míbhuntaiste oideachais atá i gceist

source: The 1998 Act defines support services as including, among other things:
ga: Sé an sainmhíniú atá ag an Acht ar sheirbhísí tacaíochta ná ( i measc gnéithe eile ):

source: • Guidance and counselling services
ga: • Seirbhísí Chomhairleacha agus Threoracha

source: • Technical aids and equipment, including means of access to schools, adaptations to buildings to facilitate access and transport for students with special needs and their families
ga: • Fearas agus Áiseanna theicniúla, ina measc bealach isteach chuig scoileanna, athrú ar fhoirgnimh chun bealach isteach a réiteach, agus córas taistil do dhaltaí le riachtanais speisialta agus dá gcuid teaghlaigh

source: • Provision for students learning through Irish sign language or other sign language, including interpreting services
ga: • Áiseanna do dhaltaí atá ag foghlaim tré mhéan teanga chomhartha na hÉireann nó teanga chomhartha eile agus seirbhísí teangaireachta ina measc

source: • Provision for early childhood, primary, post-primary, adult or continuing education to students with special needs otherwise than in schools or centres for education
ga: • Áiseanna le haghaidh luathoideachas, oideachas bunscoile, iarbhunscoile agus aosach nó leanúnach do dhaltaí le riachtanais speisialta taobh amuigh de scoileanna nó de ionaid oideachais

source: The Equal Status Acts 2000-2011
ga: Na hAchtanna Ionannais Stádais 2000-2011

source: The Equal Status Act 2000-2011, outlaws discrimination in areas of life - mainly the provision of services
ga: Eisreachtaíonn na hAchtanna um Stádas Comhionann 2000 - 2011 an t-idirdhealú i réimsí saoil lasmuigh den obair - go háirithe i soláthar seirbhísí

source: The Acts apply to educational services, including private schools and pre-school facilities
ga: Baineann na nAchtanna le seirbhísí oideachais - scoileanna príobháideacha agus áiseanna réamhscoile san áireamh

source: There are certain specific provisions in the Acts in relation to education and some of these deal with people with disabilities or people who have special needs
ga: Tá coinníollacha ar leith san Acht maidir le hoideachas agus baineann cuid acu sin le daoine le míchumas nó daoine a bhfuil riachtanais speisialta acu

source: The Equal Status Acts outlaw direct and indirect discrimination on a number of grounds including gender, religion, disability, race and membership of the Traveller community
ga: Coscann na nAchtanna idirdhealú díreach agus indíreach ar bhunúis éagsúla, ina measc gnéas, reiligiún, míchumas, cine agus ballríocht den lucht taistil

source: Under the law, a school may not discriminate in relation to:
ga: Faoin Acht ní féidir le scoil idirdhealú a dhéanamh ar bhunús:

source: • The admission or the terms and conditions of admission of a student
ga: • Cead isteach nó na tearmaí agus na coinníollacha a bhaineann leis an gcead isteach

source: • The access of a student to any course, facility or benefit provided
ga: • Bealach isteach an scoláire chuig aon chúrsa, áis nó sochar atá curtha ar fáil

source: • Any other term or condition of participation in the school by the student
ga: • Aon téarma nó coinníoll eile a bhainfeadh le rannpháirtíocht an scoláire sa scoil

source: • The expulsion of a student or any other sanction
ga: • Díbirt an scoláire nó aon phionós eile

source: Discrimination on grounds of disability
ga: Idirdhealú ar bhunú míchumais

source: The Equal Status Acts set out certain activities that do not constitute discrimination
ga: Leagann an nAchtanna um Stádas Comhionann síos imeachtaí áirithe nach údar idirdhealaithe iad

source: The following relate to discrimination on the grounds of disability:
ga: Baineann siad seo a leanas le idirdhealú ar bhunús míchumais:

source: • Schools may make different arrangements for sport for children on the basis of age, gender or disability if these are reasonably necessary
ga: • Is féidir le scoileanna socruithe ar leith a dhéanamh le haghaidh spóirt do pháistí ar bhunús aoise, gnéis nó míchumais má tá gá ciallmhar leo

source: • Schools will not be considered to discriminate against a student with a disability if compliance with the provisions of the legislation would have a seriously detrimental effect on or make impossible the provision of services to other students
ga: • Ní bheidh idirdhealú déanta ag scoil i gcoinne dalta le míchumas má chiallaíonn claoí leis an Acht go mbeadh droch thioncar aige ar dhaltaí eile nó go mbeadh sé dodhéanta seirbhísí a chur ar fáil dóibh

source: • In certain circumstances, discrimination on the grounds of disability can occur if there is a failure to do all that is reasonable to accommodate the needs of a person with a disability
ga: • I gcásanna áirithe, is féidir le idirdhealú ar bhunús míchumais tarlú mura mbíonn gach iarracht réasúnta déanta rudaí a chur in oiriúint do dhuine le míchumas

source: If a person with a disability cannot avail of a service without the provision of special treatment or facilities then the service provider may be required to provide such special arrangements if there is only a nominal cost involved
ga: Munar féidir le duine míchumasach úsáid a bhaint as seirbhís gan cóireáil nó áiseanna speisialta a bheith curtha ar fáil, ansin d'fhéadfaí iarradh ar an té atá ag cur na seirbhísí ar fáil na socruithe speisialta seo a dhéanamh mura bhfuil ach costas ainmneach i gceist

source: • The Act includes a provision that clarifies that the nominal cost issue does not prejudice or dilute the various provisions in the Education Act 1998 in relation to children with a disability
ga: • Tá coinníoll san Acht a dhéanann soiléiriú ar "chostas ainmneach", sé sin nach bhfuil an costas / ainmneacha díobhálach do, agus nach ndéanann siad maolú ar, na gnéithe éagsúla atá san Acht Oideachais 1998 maidir le páistí le míchumais

source: It should be noted that these provisions all relate to the use of public funds
ga: Ba cheart a thuiscint go mbaineann na rialacha seo ar fad le úsáid airgead poiblí

source: This means that private primary schools are only obliged to make special provision for children with disabilities if there is only a nominal cost involved
ga: Ciallaíonn sé seo nach bhfuil gá do scoileanna príobháideacha socruithe speisialta a dhéanamh do pháistí le míchumais ach amháin sa chás agus nach bhfuil ach costas ainmneach i gceist
